cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'puma/puma'

# Development
brew 'go'
brew 'rustup'

# Binaries
brew 'ack'
brew 'awscli'
brew 'certbot'
brew 'coreutils'
brew 'ffmpeg'
brew 'git'
brew 'grc'
brew 'heroku'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'nvm'
brew 'readline'
brew 'roundup'
brew 'spaceman-diff'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'yarn'

# Fonts
cask 'font-architects-daughter'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-hack'
cask 'font-jetbrains-mono'
cask 'font-karla'
cask 'font-lato'
cask 'font-roboto'
cask 'font-roboto-mono'

# Apps
cask 'visual-studio-code'

# Shell
brew 'zsh'
