cask_args appdir: '/Applications'

tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'puma/puma'

# Development
brew 'git'
brew 'go'
brew 'nvm'
brew 'rbenv'
brew 'rustup'
brew 'yarn'

# Cloud
brew 'awscli'
brew 'heroku'

# Binaries
brew 'ack'
brew 'certbot'
brew 'coreutils'
brew 'ffmpeg'
brew 'grc'
brew 'htop'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'readline'
brew 'roundup'
brew 'spaceman-diff'
brew 'tree'
brew 'unrar'
brew 'wget'

# Fonts
#cask 'font-architects-daughter'
#cask 'font-fira-code'
#cask 'font-fira-mono'
#cask 'font-hack'
#cask 'font-jetbrains-mono'
#cask 'font-karla'
#cask 'font-lato'
#cask 'font-roboto'
#cask 'font-roboto-mono'

# Apps
cask 'hyper'
cask 'iterm2'
cask 'visual-studio-code'
